{
  "curs": {
    "nom": "Excel",
    "descripcio": "Aprèn a dominar Excel des de zero fins a nivell avançat, aplicat a l'anàlisi de dades.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Taules dinàmiques i informes visuals",
    "numero": 10,
    "dificultat": "Avançat",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Crear una taula dinàmica bàsica",
      "tipus": "codi",
      "descripcio": "Les taules dinàmiques són una eina poderosa a Excel que ens permeten analitzar i resumir grans conjunts de dades de manera eficient. Per crear una taula dinàmica bàsica, necessitem seleccionar les dades que volem analitzar i després anar a la pestanya 'Insertar' i seleccionar 'Taula dinàmica'. A partir d'aquí, podem configurar la taula dinàmica per mostrar les dades de la manera que més ens convingui.",
      "enunciat": "Crea una taula dinàmica que mostri la suma dels ingressos per cada categoria de producte.",
      "solucio": "Taula dinàmica amb la suma dels ingressos per cada categoria de producte",
      "solucio_codi_1": "=SUMMARIZE(ALL('Taula de dades'), 'Taula de dades'[Categoria de producte], 'Taula de dades'[Ingressos])",
      "solucio_codi_2": "=RESUMIR(TODOS('Tabla de datos'), 'Tabla de datos'[Categoría de producto], 'Tabla de datos'[Ingresos])",
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Assegura't de seleccionar les dades correctes abans de crear la taula dinàmica.",
      "pista_2": "Ajusta les opcions de la taula dinàmica per mostra les dades de la manera que més et convingui.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Filtrar una taula dinàmica",
      "tipus": "codi",
      "descripcio": "Un cop creada la taula dinàmica, podem filtrar les dades per mostrar només les que ens interessin. Per fer-ho, podem utilitzar les funcions de filtre de la taula dinàmica, com ara el filtre de dates o el filtre de valors.",
      "enunciat": "Filtrea la taula dinàmica per mostrar només les dades dels últims 3 mesos.",
      "solucio": "Taula dinàmica filtrada per mostrar només les dades dels últims 3 mesos",
      "solucio_codi_1": "=FILTER('Taula de dades', 'Taula de dades'[Data] >= TODAY() - 90)",
      "solucio_codi_2": "=FILTRO('Tabla de datos', 'Tabla de datos'[Fecha] >= HOY() - 90)",
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Assegura't de seleccionar la columna de dates correcta per aplicar el filtre.",
      "pista_2": "Ajusta el període de dates per mostrar les dades des dels últims 3 mesos.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Crear un gràfic dinàmic",
      "tipus": "codi",
      "descripcio": "Un gràfic dinàmic és una representació visual de les dades que podem crear a partir d'una taula dinàmica. Per crear un gràfic dinàmic, podem seleccionar les dades que volem representar i després anar a la pestanya 'Insertar' i seleccionar 'Gràfic'. A partir d'aquí, podem configurar el gràfic per mostrar les dades de la manera que més ens convingui.",
      "enunciat": "Crea un gràfic dinàmic que mostri la tendència dels ingressos per cada categoria de producte.",
      "solucio": "Gràfic dinàmic que mostra la tendència dels ingressos per cada categoria de producte",
      "solucio_codi_1": "=SERIES('Taula de dades', 'Taula de dades'[Categoria de producte], 'Taula de dades'[Ingressos])",
      "solucio_codi_2": "=SERIE('Tabla de datos', 'Tabla de datos'[Categoría de producto], 'Tabla de datos'[Ingresos])",
      "temps_estimat_minuts": 15,
      "respostes_test": [],
      "pista_1": "Assegura't de seleccionar les dades correctes abans de crear el gràfic.",
      "pista_2": "Ajusta les opcions del gràfic per mostra les dades de la manera que més et convingui.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Quin és el propòsit de les taules dinàmiques?",
      "tipus": "test",
      "descripcio": "Les taules dinàmiques són una eina poderosa a Excel que ens permeten analitzar i resumir grans conjunts de dades de manera eficient. Però, quin és el propòsit principal de les taules dinàmiques?",
      "enunciat": "Quin és el propòsit principal de les taules dinàmiques?",
      "solucio": "Anàlisi i resum de dades",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "Crear gràfics",
        "Crear taules",
        "Anàlisi i resum de dades",
        "Editar dades"
      ],
      "pista_1": "Les taules dinàmiques són utilitzades per analitzar i resumir dades.",
      "pista_2": "Les taules dinàmiques no són utilitzades per crear gràfics o taules.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Personalitzar un informe amb resum de dades",
      "tipus": "codi",
      "descripcio": "Un cop creada la taula dinàmica, podem personalitzar l'informe per mostrar un resum de les dades. Per fer-ho, podem utilitzar les funcions de resum de la taula dinàmica, com ara la mitjana o la suma.",
      "enunciat": "Personalitza l'informe per mostrar la mitjana dels ingressos per cada categoria de producte.",
      "solucio": "Informe personalitzat que mostra la mitjana dels ingressos per cada categoria de producte",
      "solucio_codi_1": "=AVERAGEIF('Taula de dades', 'Taula de dades'[Categoria de producte], 'Taula de dades'[Ingressos])",
      "solucio_codi_2": "=MEDIAFI('Tabla de datos', 'Tabla de datos'[Categoría de producto], 'Tabla de datos'[Ingresos])",
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Assegura't de seleccionar la columna de dades correcta per aplicar la funció de resum.",
      "pista_2": "Ajusta les opcions de la funció de resum per mostra la mitjana dels ingressos.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}