{
  "curs": {
    "nom": "PYTHON",
    "descripcio": "Domina Python per a l'anàlisi de dades, des de programació bàsica fins a models de Machine Learning aplicats.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Variables i tipus de dades",
    "numero": 1,
    "dificultat": "Fàcil",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Creació de variables",
      "tipus": "exe",
      "descripcio": "En aquest exercici, aprendràs a crear variables en Python. Les variables són espais de memòria que emmagatzemen valors. Per crear una variable, simplement has d'assignar un valor a un nom. Per exemple, si vols crear una variable anomenada 'x' i assignar-li el valor 5, pots fer-ho així: x = 5. Recorda que els noms de les variables han de ser descriptius i no poden contenir espais.",
      "enunciat": "Crea una variable anomenada 'nom' i assigna-li el valor 'John'.",
      "solucio": "nom = 'John'",
      "solucio_codi_1": "nom = 'John'",
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Recorda que les variables en Python no requereixen una declaració explícita de tipus.",
      "pista_2": "Assegura't que el nom de la variable estigui entre cometes simples o dobles quan és una cadena.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Tipus bàsics de dades",
      "tipus": "test",
      "descripcio": "En aquest exercici, aprendràs sobre els tipus bàsics de dades en Python. Els tipus bàsics inclouen int, float, str i bool. Cada tipus de dada serveix per a un propòsit específic. Per exemple, int és per a nombres enters, float és per a nombres decimals, str és per a cadenes de text i bool és per a valors booleans (verdader o fals).",
      "enunciat": "Quin és el tipus de dada de la variable '5'?",
      "solucio": "int",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "float",
        "str",
        "bool",
        "int"
      ],
      "pista_1": "Recorda que els nombres sense decimals són tipus int.",
      "pista_2": "Assegura't de comprendre la diferència entre els tipus bàsics.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Conversió de tipus",
      "tipus": "exe",
      "descripcio": "En aquest exercici, aprendràs a convertir entre diferents tipus de dades en Python. La conversió de tipus és útil quan necessites canviar el tipus de dada d'una variable. Per exemple, pots convertir un string a un int amb la funció int() o un float a un int amb la funció int().",
      "enunciat": "Converteix la cadena '10' a un enter.",
      "solucio": "int('10')",
      "solucio_codi_1": "int('10')",
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Recorda que la conversió de tipus pot fallar si el valor no és convertible.",
      "pista_2": "Assegura't de comprendre les diferents funcions de conversió com int(), float(), str().",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Bones pràctiques de nomenclatura",
      "tipus": "test",
      "descripcio": "En aquest exercici, aprendràs sobre les bones pràctiques de nomenclatura en Python. La nomenclatura és important perquè fa que el codi sigui llegible i mantenible. Una bona pràctica és utilitzar noms de variables que siguin descriptius i fàcils d'entendre. Per exemple, en comptes de 'x', podríem utilitzar 'edat_usuari'.",
      "enunciat": "Quina és la millor pràctica per als noms de les variables en Python?",
      "solucio": "Utilitzar noms descriptius",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "Utilitzar noms curts",
        "Utilitzar noms aleatoris",
        "No utilitzar cap convenció",
        "Utilitzar noms descriptius"
      ],
      "pista_1": "Recorda que la claritat és clau per al manteniment del codi.",
      "pista_2": "Assegura't de seguir les convencions de la comunitat Python.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Conversió de tipus complexa",
      "tipus": "IA",
      "descripcio": "En aquest exercici, aplicaràs els conceptes de conversió de tipus i nomenclatura per resoldre un problema més complex. T'hauràs d'encarregar de convertir una llista de strings que representen números decimals a una llista de floats, i després calcular la mitjana d'aquests valors.",
      "enunciat": "Donada la llista ['1.2', '3.4', '5.6'], converteix-la a una llista de floats i calcula la mitjana.",
      "solucio": null,
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Utilitza una llista per emmagatzemar els valors convertits.",
      "pista_2": "La funció sum() pot ser útil per sumar tots els elements de la llista.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}