{
  "curs": {
    "nom": "Data Analytics",
    "subnom":"Python",
    "descripcio": "Domina Python per a l'anàlisi de dades, des de programació bàsica fins a models de Machine Learning aplicats.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Introducció a Machine Learning amb Scikit-learn",
    "numero": 10,
    "dificultat": "Avançat",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Preparació de datasets per modelar",
      "tipus": "IA",
      "descripcio": "En aquest exercici, aprendràs a preparar un conjunt de dades per a ser utilitzat en el modelatge de Machine Learning. La preparació de dades és un pas crucial en el procés de modelatge, ja que les dades han de ser netes, completes i enformatades de manera adequada per a ser processades pels algorismes de Machine Learning. Un exemple de preparació de dades és la següent: primer, s'han de carregar les dades, després, s'han de netejar les dades eliminant les entrades nul·les o les dades inconsistent, i finalment, s'han de transformar les dades en un format adequat per a ser utilitzades en el model.",
      "enunciat": "Carrega les dades del conjunt de dades 'iris' i prepara-les per a ser utilitzades en un model de Machine Learning.",
      "solucio": "Les dades estan preparades",
      "solucio_codi_1": "from sklearn.datasets import load_iris\niris = load_iris()\ndata = iris.data\n",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza la funció load_iris() del mòdul sklearn.datasets per carregar les dades.",
      "pista_2": "Assegura't que les dades estiguin en un format adequat per a ser utilitzades en un model de Machine Learning.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Separació de dades: train_test_split",
      "tipus": "IA",
      "descripcio": "En aquest exercici, aprendràs a separar les dades en conjunts d'entrenament i de prova utilitzant la funció train_test_split del mòdul sklearn.model_selection. Aquesta funció permet separar les dades en dos conjunts, un per a l'entrenament del model i un altre per a la prova del model. Un exemple de separació de dades és el següent: primer, s'han de importar les dades, després, s'han de separar les dades en dos conjunts utilitzant la funció train_test_split.",
      "enunciat": "Separa les dades del conjunt de dades 'iris' en dos conjunts, un per a l'entrenament i un altre per a la prova.",
      "solucio": "Les dades estan separades",
      "solucio_codi_1": "from sklearn.model_selection import train_test_split\nX_train, X_test, y_train, y_test = train_test_split(data, iris.target, test_size=0.2, random_state=42)\n",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza la funció train_test_split del mòdul sklearn.model_selection per separar les dades.",
      "pista_2": "Assegura't que les dades estiguin separades en dos conjunts, un per a l'entrenament i un altre per a la prova.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Entrenament d'un model de regressió lineal",
      "tipus": "IA",
      "descripcio": "En aquest exercici, aprendràs a entrenar un model de regressió lineal utilitzant la funció LinearRegression del mòdul sklearn.linear_model. Aquesta funció permet entrenar un model de regressió lineal sobre les dades d'entrenament. Un exemple de entrenament d'un model de regressió lineal és el següent: primer, s'han de importar les dades, després, s'han de separar les dades en dos conjunts, i finalment, s'han de entrenar el model de regressió lineal utilitzant la funció LinearRegression.",
      "enunciat": "Entrena un model de regressió lineal sobre les dades d'entrenament.",
      "solucio": "El model de regressió lineal està entrenat",
      "solucio_codi_1": "from sklearn.linear_model import LinearRegression\nmodel = LinearRegression()\nmodel.fit(X_train, y_train)\n",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza la funció LinearRegression del mòdul sklearn.linear_model per entrenar el model.",
      "pista_2": "Assegura't que el model estigui entrenat sobre les dades d'entrenament.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Avaluació de models amb mètriques bàsiques",
      "tipus": "test",
      "descripcio": "En aquest exercici, aprendràs a avaluar un model de regressió lineal utilitzant mètriques bàsiques com la mitjana de l'error absolut (MAE) i la mitjana de l'error al quadrat (MSE). Aquestes mètriques permeten avaluar la precisió del model en la predicció de les dades de prova. Un exemple de com avaluar un model de regressió lineal és el següent: primer, s'han de calcular les prediccions del model sobre les dades de prova, després, s'han de calcular les mètriques MAE i MSE.",
      "enunciat": "Quina és la fórmula per calcular la mitjana de l'error absolut (MAE)?",
      "solucio": "MAE = (1/n) * Σ|y_i - y_pred_i|",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "MAE = (1/n) * Σ|y_i - y_pred_i|",
        "MAE = (1/n) * Σ(y_i - y_pred_i)^2",
        "MAE = (1/n) * Σ(y_i + y_pred_i)",
        "MAE = (1/n) * Σ(y_i - y_pred_i)"
      ],
      "pista_1": "La fórmula per calcular la MAE és una suma de les diferències absolutes entre les dades reals i les prediccions.",
      "pista_2": "La fórmula per calcular la MAE és una mitjana de les diferències absolutes entre les dades reals i les prediccions.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Avaluació de models amb mètriques bàsiques II",
      "tipus": "IA",
      "descripcio": "En aquest exercici, aprendràs a avaluar un model de regressió lineal utilitzant mètriques bàsiques com la mitjana de l'error al quadrat (MSE) i el coeficient de determinació (R²). Aquestes mètriques permeten avaluar la precisió del model en la predicció de les dades de prova. Un exemple de com avaluar un model de regressió lineal és el següent: primer, s'han de calcular les prediccions del model sobre les dades de prova, després, s'han de calcular les mètriques MSE i R².",
      "enunciat": "Entrena un model de regressió lineal sobre les dades d'entrenament i avalua el model utilitzant les mètriques MSE i R².",
      "solucio": "El model de regressió lineal està entrenat i avaluat",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Utilitza la funció LinearRegression del mòdul sklearn.linear_model per entrenar el model.",
      "pista_2": "Utilitza les funcions mean_squared_error i r2_score del mòdul sklearn.metrics per calcular les mètriques MSE i R².",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}