{
  "curs": {
    "nom": "PYTHON",
    "descripcio": "Domina Python per a l'anàlisi de dades, des de programació bàsica fins a models de Machine Learning aplicats.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Regressió lineal amb Scikit-learn",
    "numero": 8,
    "dificultat": "Avançat",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Creació de datasets simples",
      "tipus": "exe",
      "descripcio": "Per crear un model de regressió lineal, primer hem de tenir un conjunt de dades adequat. En aquest exercici, crearem un dataset simple amb dues variables: la variable independent (x) i la variable dependent (y). Podem utilitzar la llibreria numpy per generar aquests valors de manera aleatòria. Per exemple, podem generar 100 valors aleatoris per x i calcular y com a 2*x + 1, on 2 és la pendent i 1 és la intersecció en y.",
      "enunciat": "Crea un dataset amb 50 valors aleatoris per x i calcula y com a 3*x + 2. Imprimeix les 5 primeres fileres del teu dataset.",
      "solucio": "Dataset creat amb x i y calculats",
      "solucio_codi_1": "import numpy as np\nx = np.random.rand(50)\ny = 3*x + 2\nprint(x[:5], y[:5])",
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza numpy.random.rand per generar valors aleatoris per x",
      "pista_2": "Calcula y com a 3*x + 2",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Separar dades d'entrenament i test",
      "tipus": "exe",
      "descripcio": "Un pas important en la creació d'un model de regressió lineal és separar les dades en conjunts d'entrenament i de prova. Això ens permet entrenar el model amb les dades d'entrenament i avaluar la seva precisió amb les dades de prova. Podem utilitzar la funció train_test_split de la llibreria scikit-learn per fer aquesta separació.",
      "enunciat": "Separa les dades generades en l'exercici 1 en conjunts d'entrenament i de prova amb una proporció de 0.7 per a les dades d'entrenament.",
      "solucio": "Dades separades en entrenament i prova",
      "solucio_codi_1": "from sklearn.model_selection import train_test_split\nx_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=42)",
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Importa la funció train_test_split de scikit-learn",
      "pista_2": "Defineix la proporció de dades per a les dades de prova",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Entrenar models de regressió",
      "tipus": "exe",
      "descripcio": "Ara que tenim les dades separades, podem entrenar un model de regressió lineal utilitzant les dades d'entrenament. La llibreria scikit-learn proporciona la classe LinearRegression per a aquest propòsit.",
      "enunciat": "Entrena un model de regressió lineal amb les dades d'entrenament generades en l'exercici 2.",
      "solucio": "Model de regressió entrenat",
      "solucio_codi_1": "from sklearn.linear_model import LinearRegression\nmodel = LinearRegression()\nmodel.fit(x_train.reshape(-1, 1), y_train)",
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Importa la classe LinearRegression de scikit-learn",
      "pista_2": "Ajusta el model als datos d'entrenament",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Avaluar el model de regressió",
      "tipus": "test",
      "descripcio": "Després d'entrenar el model, és important avaluar la seva precisió. Un dels indicadors comuns per avaluar la precisió d'un model de regressió és el coeficient de determinació (R2). Aquest coeficient varia entre 0 i 1, on 1 indica una predició perfecta.",
      "enunciat": "Què vol dir un valor de R2 de 0.8 en la precisió d'un model de regressió?",
      "solucio": "Un valor de R2 de 0.8 indica que el 80% de la variància en les dades de prova és explicat per el model.",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "El model explica el 20% de la variància",
        "El model explica el 50% de la variància",
        "El model explica el 80% de la variància",
        "El model no té cap relació amb la variància"
      ],
      "pista_1": "Recorda la definició del coeficient de determinació (R2)",
      "pista_2": "Interpreta el valor de R2 en el context de la precisió del model",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Entrenar i avaluar un model de regressió lineal complet",
      "tipus": "IA",
      "descripcio": "Ara, combinarem tots els passos per entrenar i avaluar un model de regressió lineal complet. Començarem creant un dataset, el separarem en dades d'entrenament i de prova, entrenarem un model de regressió lineal i finalment l'avaluarem mitjançant el coeficient de determinació (R2) i l'error quadràtic mitjà (MSE).",
      "enunciat": "Crea un dataset amb 100 valors aleatoris per x, calcula y com a 2*x + 1, separa les dades en entrenament i prova, entrena un model de regressió lineal i calcula R2 i MSE.",
      "solucio": "Model de regressió lineal entrenat i avaluat",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "temps_estimat_minuts": 15,
      "respostes_test": [],
      "pista_1": "Recorda tots els passos anteriorment aprendits",
      "pista_2": "Combina tots els codis per crear el model i calcular R2 i MSE",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}