{
  "curs": {
    "nom": "Data Analytics",
    "subnom":"Python",
    "descripcio": "Domina Python per a l'anàlisi de dades, des de programació bàsica fins a models de Machine Learning aplicats.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Funcions i estructures de dades",
    "numero": 3,
    "dificultat": "Mitjà",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Definir una funció pròpia",
      "tipus": "codi",
      "descripcio": "Les funcions són eines fonamentals en Python. Les funcions permeten reutilitzar codi, fer que els programes siguin més llegibles i ajuden a evitar la repetició de codi. Per definir una funció en Python, fem servir la paraula clau 'def' seguida del nom de la funció i uns parèntesis on es poden especificar els paràmetres. Per exemple, per crear una funció que simplement imprimeixi un missatge, podem fer: def saluda(nom): print('Hola, ' + nom). Aquesta funció prendre una cadena com a paràmetre (el nom de la persona) i la utilitzarà per imprimir un salutació personalitzada.",
      "enunciat": "Crea una funció anomenada 'suma' que accepti dos números com a paràmetres i retorni la seva suma.",
      "solucio": "Definició de la funció 'suma' que accepta dos paràmetres i retorna la seva suma.",
      "solucio_codi_1": "def suma(a, b):\n    return a + b",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza 'def' per començar a definir la funció.",
      "pista_2": "No oblidis els parèntesis després del nom de la funció per posar els paràmetres.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Treballar amb llistes",
      "tipus": "completar_codi",
      "descripcio": "Les llistes en Python són una estructura de dades múltiples que poden contenir valors de diferents tipus, incloses seqüències de caràcters, enters, flaotants i fins i tot altres llistes. Per afegir un element a una llista, podem utilitzar el mètode 'append()'. L'índex és la posició d'un element dins d'una llista. Les llistes són indexades, el que significa que cada element té una posició que podem fer servir per accedir-hi.",
      "enunciat": "Completa el codi següent per afegir l'element '3' a la llista 'llista_numeros' i després imprimeixi la llista: llista_numeros = [1, 2, 3]",
      "solucio": "llista_numeros = [1, 2, 3]\nllista_numeros.append(3)\nprint(llista_numeros)",
      "solucio_codi_1": "llista_numeros = [1, 2, 3]\nllista_numeros.append(3)\nprint(llista_numeros)",
      "solucio_codi_2": null,
      "codi_a_completar": "llista_numeros = [<placeholder>]\nllista_numeros.<placeholder>(3)\nprint(llista_numeros)",
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza el mètode append() per afegir el número 3.",
      "pista_2": "No oblidis imprimir la llista després d'afegir-hi el nou element.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Test sobre diccionaris",
      "tipus": "test",
      "descripcio": "Els diccionaris són una altra estructura de dades en Python. Estan composts per parelles clau-valor, on cada clau és única i associa un valor amb ella. Els diccionaris són molt útils per emmagatzemar i accedir a dades en un format flexible.",
      "enunciat": "Quin és el terme en Python que es fa servir per a referir-se al valor que s'usa per a accedir a un altre valor associat dins d'un diccionari?",
      "solucio": "clau",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 2,
      "respostes_test": [
        "Valor",
        "Clau",
        "Índex",
        "Claus"
      ],
      "pista_1": "Recorda la forma en que es defineixen i accedeixen els valors en un diccionari.",
      "pista_2": "Un diccionari no utilitza índexs com les llistes, sinó alguna cosa més.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Ús de conjunts",
      "tipus": "codi",
      "descripcio": "Els conjunts en Python són col·leccions no ordenades d'elements útics. Són molt útils quan necessitem verificar l'existència d'un element dins d'un conjunt o quan volem realitzar operacions com la unió o intersecció entre conjunts. Per crear un conjunt, podem utilitzar la paraula clau 'set' seguida dels elements entre parèntesis o les claus {} amb els elements separats per comes.",
      "enunciat": "Crea un conjunt amb els números 1, 2 i 3, i després verifica si el número 2 està present en el conjunt.",
      "solucio": "Codi per crear un conjunt i verificar la presència d'un element.",
      "solucio_codi_1": "conjunt = {1, 2, 3}\nprint(2 in conjunt)",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Utilitza les claus {} per crear el conjunt.",
      "pista_2": "L'operador 'in' serveix per comprovar si un element està en un conjunt.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Ús de funcions lambda",
      "tipus": "IA",
      "descripcio": "Les funcions lambda en Python són una forma compacta de definir funcions petites anònimes. Són especialment útils quan necessitem una funció senzilla que es pugui definir en una sola línia. Per exemple, una funció lambda que prengui un argument 'x' i retorni 'x al quadrat' es pot definir com: lambda x: x**2.",
      "enunciat": "Crea una funció lambda que, donat un número 'x', retorni el doble del seu valor.",
      "solucio": "Definició de la funció lambda per calcular el doble d'un número.",
      "solucio_codi_1": "dobla = lambda x: 2 * x",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Recorda la sintaxi bàsica de les funcions lambda.",
      "pista_2": "La funció lambda per calcular el doble és molt similar a la que calcula el quadrat, però canvia l'operació.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}