{
  "curs": {
    "nom": "Data Analytics",
    "subnom":"Python",
    "descripcio": "Domina Python per a l'anàlisi de dades, des de programació bàsica fins a models de Machine Learning aplicats.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Neteja i preparació de datasets",
    "numero": 7,
    "dificultat": "Mitjà",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Detectar valors anòmals en un conjunt de dades",
      "tipus": "codi",
      "descripcio": "En aquest exercici, aprendràs a detectar valors anòmals en un conjunt de dades utilitzant la libreria Pandas de Python. Primer, cal importar les biblioteques necessàries i generar un conjunt de dades de mostra. Després, cal utilitzar el mètode 'describe' per obtenir estadístiques bàsiques del conjunt de dades i identificar valors anòmals. Per exemple, si tenim un conjunt de dades de temperatures i observem que hi ha valors que estan molt per sobre o per sota de la mitjana, podem considerar-los com a valors anòmals.",
      "enunciat": "Crea un conjunt de dades de 10 temperatures aleatòries entre 20 i 30 graus Celsius, i detecta quins valors són anòmals si considerem que els valors anòmals estan més de 2 desviacions estàndard per sobre o per sota de la mitjana.",
      "solucio": "Valors anòmals: [15, 35]",
      "solucio_codi_1": "import pandas as pd\nimport numpy as np\n\ndata = pd.DataFrame({'Temperatura': np.random.uniform(20, 30, 10)})\ndata['Temperatura'] = np.random.uniform(15, 35, 10)\nmitjana = data['Temperatura'].mean()\ndesviacio = data['Temperatura'].std()\nvalors_anomals = data[(data['Temperatura'] < (mitjana - 2*desviacio)) | (data['Temperatura'] > (mitjana + 2*desviacio))]\nprint(valors_anomals)",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Cal utilitzar la funció 'mean' i 'std' de la libreria Pandas per calcular la mitjana i la desviació estàndard del conjunt de dades.",
      "pista_2": "Cal utilitzar la funció 'describe' per obtenir estadístiques bàsiques del conjunt de dades.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Conversió de tipus de columnes",
      "tipus": "completar_codi",
      "descripcio": "En aquest exercici, aprendràs a convertir el tipus de columna d'un conjunt de dades utilitzant la libreria Pandas de Python. Primer, cal importar les biblioteques necessàries i generar un conjunt de dades de mostra. Després, cal utilitzar el mètode 'astype' per convertir el tipus de columna. Per exemple, si tenim un conjunt de dades de números i volem convertir-los a tipus 'float', podem utilitzar el mètode 'astype' amb el paràmetre 'float'.",
      "enunciat": "Crea un conjunt de dades de 10 números enters i converteix la columna a tipus 'float'.",
      "solucio": "Columna convertida a tipus 'float'",
      "solucio_codi_1": "import pandas as pd\nimport numpy as np\n\ndata = pd.DataFrame({'Numeros': np.random.randint(1, 100, 10)})",
      "solucio_codi_2": null,
      "codi_a_completar": "data['Numeros'] = data['Numeros'].<placeholder>('<tipus>')",
      "temps_estimat_minuts": 5,
      "respostes_test": [],
      "pista_1": "Cal utilitzar el mètode 'astype' per convertir el tipus de columna.",
      "pista_2": "Cal assignar el resultat de la conversió a la columna original.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Normalització de formats de dades",
      "tipus": "test",
      "descripcio": "En aquest exercici, aprendràs a normalitzar formats de dades utilitzant la libreria Pandas de Python. Primer, cal importar les biblioteques necessàries i generar un conjunt de dades de mostra. Després, cal utilitzar el mètode 'apply' per aplicar una funció que normalitzi el format de les dades. Per exemple, si tenim un conjunt de dades de dates i volem normalitzar-les al format 'YYYY-MM-DD', podem utilitzar el mètode 'apply' amb una funció que converteixi les dates a aquest format.",
      "enunciat": "Quin és el millor mètode per normalitzar un conjunt de dades de dates?",
      "solucio": "Utilitzar el mètode 'apply' amb una funció que converteixi les dates al format desitjat",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "Utilitzar el mètode 'apply' amb una funció que converteixi les dates al format desitjat",
        "Utilitzar el mètode 'map' per substituir els valors de les dates",
        "Utilitzar el mètode 'groupby' per agrupar les dates per any",
        "Utilitzar el mètode 'sort_values' per ordenar les dates"
      ],
      "pista_1": "Cal utilitzar el mètode 'apply' per aplicar una funció a les dades.",
      "pista_2": "Cal definir una funció que converteixi les dates al format desitjat.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Preparació de dades per modelatge",
      "tipus": "IA",
      "descripcio": "En aquest exercici, aprendràs a preparar un conjunt de dades per a la creació d'un model de Machine Learning. Primer, cal importar les biblioteques necessàries i generar un conjunt de dades de mostra. Després, cal preprocessar les dades per eliminar les files i columnes buides, i escalar les dades per que estiguin en el mateix rang. Finalment, cal dividir les dades en un conjunt d'entrenament i un conjunt de prova.",
      "enunciat": "Crea un conjunt de dades de 100 mostres de dades per a la creació d'un model de regressió lineal, i prepara les dades per a l'entrenament del model.",
      "solucio": "Conjunt de dades preparat per a l'entrenament del model",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 15,
      "respostes_test": [],
      "pista_1": "Cal importar les biblioteques necessàries, com Pandas i Scikit-learn.",
      "pista_2": "Cal preprocessar les dades per eliminar les files i columnes buides, i escalar les dades.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Eliminació de valors anòmals en un conjunt de dades",
      "tipus": "codi",
      "descripcio": "En aquest exercici, aprendràs a eliminar valors anòmals en un conjunt de dades utilitzant la libreria Pandas de Python. Primer, cal importar les biblioteques necessàries i generar un conjunt de dades de mostra. Després, cal utilitzar el mètode 'describe' per obtenir estadístiques bàsiques del conjunt de dades i identificar valors anòmals. Finalment, cal eliminar aquests valors anòmals del conjunt de dades.",
      "enunciat": "Crea un conjunt de dades de 10 números enters i elimina els valors que estiguin més de 2 desviacions estàndard per sobre o per sota de la mitjana.",
      "solucio": "Conjunt de dades sense valors anòmals",
      "solucio_codi_1": "import pandas as pd\nimport numpy as np\n\ndata = pd.DataFrame({'Numeros': np.random.randint(1, 100, 10)})\nmitjana = data['Numeros'].mean()\ndesviacio = data['Numeros'].std()\ndata = data[(data['Numeros'] > (mitjana - 2*desviacio)) & (data['Numeros'] < (mitjana + 2*desviacio))]\nprint(data)",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Cal utilitzar el mètode 'describe' per obtenir estadístiques bàsiques del conjunt de dades.",
      "pista_2": "Cal identificar els valors anòmals i eliminar-los del conjunt de dades.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}