{
  "curs": {
    "nom": "SQL",
    "descripcio": "Aprèn a dominar les tècniques de consulta i anàlisi de dades amb SQL, des de les bases fins a les subconsultes i les consultes anidades.",
    "color_fons": "#F4F8F4"
  },
  "capitol": {
    "titol": "Subconsultes i consultes anidades",
    "numero": 5,
    "dificultat": "Mitjà",
    "preu": 0.0
  },
  "exercicis": [
    {
      "numero": 1,
      "titol": "Subqueries a SELECT",
      "tipus": "codi",
      "descripcio": "Les subconsultes a la clàusula SELECT permeten obtenir valors específics d'una taula per utilitzar-los en una consulta principal. Aquesta tècnica és útil quan es desitja calcular valors agregats o obtenir dades específiques sense tenir que unir totes les taules.",
      "enunciat": "Crea una consulta que retorni el nom del departament i el número de treballadors que treballen en cada departament, fent servir una subconsulta a la clàusula SELECT.",
      "solucio": "Consulta que retorna el nom del departament i el número de treballadors.",
      "solucio_codi_1": "SELECT departament, (SELECT COUNT(*) FROM treballadors WHERE treballadors.departament = departaments.nom) AS num_treballadors FROM departaments;",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Utilitza una subconsulta a la clàusula SELECT per comptar el nombre de treballadors en cada departament.",
      "pista_2": "Assegura't de relacionar les taules correctament per obtenir els resultats correctes.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 2,
      "titol": "Subqueries a WHERE",
      "tipus": "codi",
      "descripcio": "Les subconsultes a la clàusula WHERE permeten restringir els resultats d'una consulta en funció de condicions específiques. Aquesta tècnica és útil quan es desitja aplicar filtres complexos a les dades.",
      "enunciat": "Crea una consulta que retorni totes les filials on el pressupost és major que la mitjana dels pressupostos de totes les filials.",
      "solucio": "Consulta que retorna les filials amb pressupost superior a la mitjana.",
      "solucio_codi_1": "SELECT * FROM filials WHERE pressupost > (SELECT AVG(pressupost) FROM filials);",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 10,
      "respostes_test": [],
      "pista_1": "Utilitza una subconsulta a la clàusula WHERE per calcular la mitjana dels pressupostos.",
      "pista_2": "Asegura't de comparar els valors correctament per obtenir les filials amb pressupost major que la mitjana.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 3,
      "titol": "Comparació entre JOINs i Subqueries",
      "tipus": "test",
      "descripcio": "La elecció entre JOINs i subqueries dependeix del context de la consulta i dels resultats desitjats. És important comprendre les diferències clau entre aquestes dues tècniques.",
      "enunciat": "Quina és la principal diferència entre utilitzar JOINs i subqueries en una consulta SQL?",
      "solucio": "JOINs combinen taules mentre que subqueries retornen valors específics.",
      "solucio_codi_1": null,
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 5,
      "respostes_test": [
        "JOINs són més ràpids que les subqueries.",
        "Les subqueries només es poden utilitzar en la clàusula WHERE.",
        "JOINs combinen taules mentre que subqueries retornen valors específics.",
        "Les subqueries sempre són més eficients que els JOINs."
      ],
      "pista_1": "Recorda que JOINs serveixen per combinar dades de múltiples taules.",
      "pista_2": "Subqueries es fan servir per obtenir valors específics o realitzar càlculs.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 4,
      "titol": "Subqueries correlacionades",
      "tipus": "codi",
      "descripcio": "Les subqueries correlacionades són subconsultes que depenen dels valors de la consulta principal. Són útils per obtenir resultats basats en condicions dinàmiques.",
      "enunciat": "Crea una consulta que retorni els empleats que tenen un sou superior al sou mitjà del seu departament.",
      "solucio": "Consulta que retorna els empleats amb sou superior al seu departament.",
      "solucio_codi_1": "SELECT * FROM empleats e WHERE sou > (SELECT AVG(sou) FROM empleats WHERE departament = e.departament);",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 12,
      "respostes_test": [],
      "pista_1": "Utilitza una subconsulta correlacionada per calcular la mitjana del sou per departament.",
      "pista_2": "Asegura't de referenciar les taules correctament per obtenir el sou mitjà del departament de cada empleat.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    },
    {
      "numero": 5,
      "titol": "Subqueries en la clàusula FROM",
      "tipus": "codi",
      "descripcio": "Les subqueries també es poden utilitzar en la clàusula FROM per crear taules derivades. Aquesta tècnica permet treballar amb conjunts de dades generals que es poden filtrar o transformar.",
      "enunciat": "Crea una consulta que retorni el departament i el nombre d'empleats que tenen un sou superior a 50000 en aquest departament, utilitzant una subconsulta en la clàusula FROM.",
      "solucio": "Consulta que retorna el departament i el nombre d'empleats amb sou superior a 50000.",
      "solucio_codi_1": "SELECT departament, COUNT(*) FROM (SELECT * FROM empleats WHERE sou > 50000) AS alta_remuneracio GROUP BY departament;",
      "solucio_codi_2": null,
      "codi_a_completar": null,
      "temps_estimat_minuts": 12,
      "respostes_test": [],
      "pista_1": "Utilitza una subconsulta en la clàusula FROM per crear una taula derivada amb els empleats que tenen un sou superior a 50000.",
      "pista_2": "Agrupa els resultats per departament i compta el nombre d'empleats en cada departament.",
      "imatge_1": null,
      "descripcio_imatge_1": null,
      "imatge_2": null,
      "descripcio_imatge_2": null
    }
  ]
}